app/controllers/animal_controller.rb

INSERT INTO "animals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Galo"], ["created_at", "2022-01-11 14:46:03.979678"], ["updated_at", "2022-01-11 14:46:03.979678"]]
---
  def create
    #render json: Animal.create(name: params[:name]), status: :created
    animal = Animal.create(name: params[:name])

SELECT "animals".* FROM "animals"
---
  def index
    render json: Animal.all

DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]
---
  def destroy
    #render json: Animal.destroy(params[:id]), status: :ok
    animal = Animal.destroy(params[:id])

UPDATE "animals" SET "name" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["name", "peixe"], ["updated_at", "2022-01-11 15:15:08.140291"], ["id", 1]]
---
  def update
    # render json: Animal.update(params[:id], name: params[:name]),
    #        status: :ok
    animal = Animal.update(params[:id], name: params[:name])

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    animal = Animal.find(params[:id])