app/controllers/animal_controller.rb

INSERT INTO "animals" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "porquinho da india"], ["created_at", "2022-01-11 16:34:56.218569"], ["updated_at", "2022-01-11 16:34:56.218569"]]
---
  def create
    #render json: Animal.create(name: params[:name]), status: :created
    animal = Animal.create(name: params[:name])

SELECT "animals".* FROM "animals"
---
  def index
    render json: Animal.all

DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 5]]
---
  def destroy
    #render json: Animal.destroy(params[:id]), status: :ok
    animal = Animal.destroy(params[:id])

UPDATE "animals" SET "id" = ?, "name" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["id", 3], ["name", "cacatua"], ["updated_at", "2022-01-11 16:39:54.517498"], ["id", 4]]
---
  def update
    # render json: Animal.update(params[:id], name: params[:name]),
    #        status: :ok
    animal = Animal.update(params[:id], name: params[:name])

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    animal = Animal.find(params[:id])