app/controllers/pet_controller.rb

INSERT INTO "pets" ("animal_id", "checkin", "checkout", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["animal_id", 1], ["checkin", "2022-01-12"], ["checkout", "2022-01-13"], ["birthdate", "2019-01-12"], ["created_at", "2022-01-12 14:53:34.673293"], ["updated_at", "2022-01-12 14:53:34.673293"]]
---
  def create
    pet = Pet.create(name: params[:name], animal_id: params[:animal_id],
                     checkin: params[:checkin],
                     checkout: params[:checkout],
                     birthdate: params[:birthdate])

DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 1]]
---
  def destroy
    pet = Pet.destroy(params[:id])

SELECT "pets".* FROM "pets"
---
  def index
    pet = Pet.all

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    pet = Pet.find(params[:id])

UPDATE "pets" SET "name" = ?, "animal_id" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Pudim"], ["animal_id", 2], ["updated_at", "2022-01-12 17:34:57.160141"], ["id", 1]]
---
  def update
    pet = Pet.update(params[:id], params.require(:pet).permit(:name, :animal_id))