app/controllers/pet_controller.rb

INSERT INTO "pets" ("name", "animal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "agnes1"], ["animal_id", 1], ["created_at", "2022-01-12 14:22:26.333687"], ["updated_at", "2022-01-12 14:22:26.333687"]]
---
  def create
    pet = Pet.create(name: params[:name], animal_id: params[:animal_id],
                     checkin: params[:checkin],
                     checkout: params[:checkout],
                     birthdate: params[:birthdate])

DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]
---
  def destroy
    pet = Pet.destroy(params[:id])

SELECT "pets".* FROM "pets"
---
  def index
    pet = Pet.all

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    pet = Pet.find(params[:id])

UPDATE "pets" SET "name" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Fofuxa"], ["updated_at", "2022-01-12 16:42:52.386934"], ["id", 4]]
---
  def update
    pet = Pet.update(params[:id], params.require(:pet).permit(:name, :animal_id))